test/svt/jmeter/plans/opa-direct-authz.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Direct OPA Authz SVT" enabled="true">
      <stringProp name="TestPlan.comments">Internal-only OPA-direct authorization load test for authz-agent.
Reuses the same semantic single/filter/bulk workload mix as the baseline Envoy-boundary scenario.
Tokens are passed via properties file: token_svt_admin, token_svt_manager, etc.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="OPA_HOST" elementType="Argument">
            <stringProp name="Argument.name">OPA_HOST</stringProp>
            <stringProp name="Argument.value">${__P(opa_host,opa)}</stringProp>
          </elementProp>
          <elementProp name="OPA_PORT" elementType="Argument">
            <stringProp name="Argument.name">OPA_PORT</stringProp>
            <stringProp name="Argument.value">${__P(opa_port,8181)}</stringProp>
          </elementProp>
          <elementProp name="THREADS" elementType="Argument">
            <stringProp name="Argument.name">THREADS</stringProp>
            <stringProp name="Argument.value">${__P(threads,30)}</stringProp>
          </elementProp>
          <elementProp name="RAMP_SECONDS" elementType="Argument">
            <stringProp name="Argument.name">RAMP_SECONDS</stringProp>
            <stringProp name="Argument.value">${__P(ramp_seconds,5)}</stringProp>
          </elementProp>
          <elementProp name="DURATION_SECONDS" elementType="Argument">
            <stringProp name="Argument.name">DURATION_SECONDS</stringProp>
            <stringProp name="Argument.value">${__P(duration_seconds,60)}</stringProp>
          </elementProp>
          <elementProp name="TARGET_RPS" elementType="Argument">
            <stringProp name="Argument.name">TARGET_RPS</stringProp>
            <stringProp name="Argument.value">${__P(target_rps,500)}</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="OPA Direct — Single Resource" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${THREADS}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${RAMP_SECONDS}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${DURATION_SECONDS}</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="requests.csv" enabled="true">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="filename">/data/requests.csv</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <boolProp name="quotedData">true</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.thread</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">username,resourceType,operation,resourceJson,requestClass,expectedDecision</stringProp>
        </CSVDataSet>
        <hashTree/>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Rate Limiter" enabled="true">
          <stringProp name="throughput">${__jexl3(${TARGET_RPS} / 3.0 * 60)}</stringProp>
          <intProp name="calcMode">2</intProp>
        </ConstantThroughputTimer>
        <hashTree/>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Resolve Token" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">
def username = vars.get("username")
def tokenKey = "token_" + username.replace("-", "_")
def token = props.get(tokenKey) ?: ""
vars.put("auth_token", token)
          </stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /v1/data/authorize" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"input":{"authorizationToken":"Bearer ${auth_token}","authorizationType":"","requestHeaders":{},"decisionLogPipTrace":true,"resources":[{"resourceType":"${resourceType}","operation":"${operation}","resource":${resourceJson}}],"subject":"Bearer ${auth_token}","ignoreRls":false}}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${OPA_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${OPA_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/v1/data/authorize</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Label + Validate (direct single)" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script">
def rc = vars.get("requestClass") ?: "OLS"
def ed = vars.get("expectedDecision") ?: "ALLOW"
prev.setSampleLabel(prev.getSampleLabel() + " [" + rc + "|" + ed + "]")
if (prev.getResponseCode() == "200") {
    def body = prev.getResponseDataAsString()
    def actual = body.contains('"isAllowed":true') ? "ALLOW" : "DENY"
    if (actual != ed) {
        prev.setSuccessful(false)
        prev.setResponseMessage("Expected " + ed + " but got " + actual)
    }
}
            </stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
      </hashTree>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="OPA Direct — Filter" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${THREADS}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${RAMP_SECONDS}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${DURATION_SECONDS}</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="requests-filter.csv" enabled="true">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="filename">/data/requests-filter.csv</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <boolProp name="quotedData">true</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.thread</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">username,resourceType,operation,requestClass,expectedCanonicalDecision,expectedFilterResult</stringProp>
        </CSVDataSet>
        <hashTree/>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Rate Limiter" enabled="true">
          <stringProp name="throughput">${__jexl3(${TARGET_RPS} / 3.0 * 60)}</stringProp>
          <intProp name="calcMode">2</intProp>
        </ConstantThroughputTimer>
        <hashTree/>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Resolve Token" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">
def username = vars.get("username")
def tokenKey = "token_" + username.replace("-", "_")
def token = props.get(tokenKey) ?: ""
vars.put("auth_token", token)
          </stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /v1/data/authorize (filter-shape)" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"input":{"authorizationToken":"Bearer ${auth_token}","authorizationType":"","requestHeaders":{},"decisionLogPipTrace":true,"resources":[{"resourceType":"${resourceType}","operation":"${operation}","resource":{}}],"subject":"Bearer ${auth_token}","ignoreRls":false}}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${OPA_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${OPA_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/v1/data/authorize</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Label + Validate (direct filter)" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script">
def rc = vars.get("requestClass") ?: "OLS"
def ed = vars.get("expectedCanonicalDecision") ?: "ALLOW"
prev.setSampleLabel(prev.getSampleLabel() + " [" + rc + "|" + ed + "]")
if (prev.getResponseCode() == "200") {
    def body = prev.getResponseDataAsString()
    def actual = body.contains('"isAllowed":true') ? "ALLOW" : "DENY"
    if (actual != ed) {
        prev.setSuccessful(false)
        prev.setResponseMessage("Expected " + ed + " but got " + actual)
    }
}
            </stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
      </hashTree>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="OPA Direct — Bulk" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${THREADS}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${RAMP_SECONDS}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${DURATION_SECONDS}</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="requests-bulk.csv" enabled="true">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="filename">/data/requests-bulk.csv</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <boolProp name="quotedData">true</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.thread</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">username,batchId,requestClass,expectedDecision</stringProp>
        </CSVDataSet>
        <hashTree/>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Rate Limiter" enabled="true">
          <stringProp name="throughput">${__jexl3(${TARGET_RPS} / 3.0 * 60)}</stringProp>
          <intProp name="calcMode">2</intProp>
        </ConstantThroughputTimer>
        <hashTree/>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Build Direct OPA Bulk Body" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">
import groovy.json.JsonBuilder
def username = vars.get("username")
def tokenKey = "token_" + username.replace("-", "_")
def token = props.get(tokenKey) ?: ""
vars.put("auth_token", token)
def batches = [
  "A1": [["ORDER","READ"],["CUSTOMER","READ"],["PRODUCT","READ"]],
  "A2": [["ORDER","CREATE"],["INVOICE","APPROVE"],["DOCUMENT","ARCHIVE"]],
  "M1": [["ORDER","READ"],["CUSTOMER","UPDATE"],["PRODUCT","IMPORT"]],
  "M2": [["INVOICE","READ"],["DOCUMENT","READ"],["ORDER","LIST"]],
  "O1": [["ORDER","READ"],["CUSTOMER","LIST"],["PRODUCT","CREATE"]],
  "V1": [["ORDER","READ"],["CUSTOMER","READ"],["PRODUCT","READ"],["INVOICE","READ"]],
  "R1": [["ORDER","LIST"],["CUSTOMER","LIST"]],
  "R2": [["ORDER","LIST"],["CUSTOMER","LIST"],["ORDER","LIST"]],
  "VD1": [["ORDER","READ"],["ORDER","CREATE"],["CUSTOMER","READ"]],
  "OD1": [["ORDER","READ"],["INVOICE","READ"],["DOCUMENT","READ"]]
]
def batchId = vars.get("batchId") ?: "A1"
def items = batches.getOrDefault(batchId, batches["A1"])
def resources = items.collect { [resourceType: it[0], operation: it[1], resource: [:]] }
def body = new JsonBuilder([
  input: [
    authorizationToken: "Bearer " + token,
    authorizationType: "",
    requestHeaders: [:],
    decisionLogPipTrace: true,
    resources: resources,
    subject: "Bearer " + token,
    ignoreRls: false
  ]
]).toString()
vars.put("opa_direct_bulk_body", body)
          </stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /v1/data/authorize (bulk)" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${opa_direct_bulk_body}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${OPA_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${OPA_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/v1/data/authorize</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Label + Validate (direct bulk)" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script">
def rc = vars.get("requestClass") ?: "OLS"
def ed = vars.get("expectedDecision") ?: "ALLOW"
prev.setSampleLabel(prev.getSampleLabel() + " [" + rc + "|" + ed + "]")
if (prev.getResponseCode() == "200") {
    def body = prev.getResponseDataAsString()
    def hasDeny = body.contains('"isAllowed":false')
    def actual = hasDeny ? "DENY" : "ALLOW"
    if (actual != ed) {
        prev.setSuccessful(false)
        prev.setResponseMessage("Expected " + ed + " but got " + actual)
    }
}
            </stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
      </hashTree>

      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>

    </hashTree>
  </hashTree>
</jmeterTestPlan>